In [1]:
import pandas as pd
location = "titanic3.xls"
df = pd.read_excel(location)
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [3]:
total_passengers = len(df) 

total_women = len(df[df['sex'] == 'female'])
total_men = len(df[df['sex'] == 'male'])
total_survived = len(df['survived'])
total_over18 = len(df[df['age'] >= 18])
total_under18 = len(df[df['age'] < 18])
total_firstclass = len(df[df['pclass'] == 1])
total_secondclass = len(df[df['pclass'] == 2])
total_thirdclass = len(df[df['pclass'] == 3])

print(total_passengers)
print(total_women) 
print(total_men)
print(total_survived)
print(total_over18)
print(total_under18)
print(total_firstclass)
print(total_secondclass)
print(total_thirdclass)

1309
466
843
1309
892
154
323
277
709

In [5]:
boyscsurvived = len(df[(df['sex'] == 'male') & (df['survived'] == 1) & (df['age'] < 18) & (df['pclass'] == 2)])
womentcsurvived = len(df[(df['sex'] == 'female') & (df['survived'] == 1) & (df['age'] >= 18) & (df['pclass'] == 3)])
manfcsurvived = len(df[(df['sex'] == 'male') & (df['survived'] == 1) & (df['age'] >= 18) & (df['pclass'] == 1)])

print(boyscsurvived)
print(womentcsurvived)
print(manfcsurvived)

11
47
47

In [7]:
p_boyscsurvived = boyscsurvived / total_passengers 
p_womentcsurvived = womentcsurvived / total_passengers 
p_manfcsurvived = manfcsurvived / total_passengers 

print(p_boyscsurvived)
print(p_womentcsurvived)
print(p_manfcsurvived)

0.008403361344537815
0.03590527119938885
0.03590527119938885

In [ ]:
## Women in 3rd class and Men in 1st class have the same chance of survival (3.6%) 
## whereas Boys in 2nd class had the least chance of survival (.84%).